{
  "terms": [
    {
      "id": 1,
      "term": "Intelligence Artificielle (IA)",
      "definition": "Technologie qui permet aux machines de simuler l'intelligence humaine, incluant l'apprentissage, le raisonnement et l'auto-correction. L'IA vise à créer des systèmes capables d'effectuer des tâches qui nécessitent normalement l'intelligence humaine.",
      "category": "Concepts de Base"
    },
    {
      "id": 2,
      "term": "Algorithme",
      "definition": "Ensemble d'instructions ou de règles définies pour résoudre un problème ou accomplir une tâche. En IA, les algorithmes sont utilisés pour traiter les données, identifier des modèles et prendre des décisions automatisées.",
      "category": "Concepts de Base"
    },
    {
      "id": 3,
      "term": "Réseau de Neurones",
      "definition": "Modèle informatique inspiré du fonctionnement du cerveau humain, composé de neurones artificiels interconnectés. Ces réseaux peuvent apprendre à partir de données pour résoudre des problèmes complexes de reconnaissance, classification et prédiction.",
      "category": "Concepts de Base"
    },
    {
      "id": 4,
      "term": "Machine Learning (Apprentissage Automatique)",
      "definition": "Sous-domaine de l'IA qui permet aux ordinateurs d'apprendre et de s'améliorer automatiquement à partir de l'expérience sans être explicitement programmés. Les algorithmes de ML identifient des modèles dans les données pour faire des prédictions.",
      "category": "Techniques d'Apprentissage"
    },
    {
      "id": 5,
      "term": "Deep Learning (Apprentissage Profond)",
      "definition": "Sous-ensemble du machine learning utilisant des réseaux de neurones artificiels avec plusieurs couches cachées. Cette approche imite le fonctionnement du cerveau humain pour traiter des données complexes comme les images, le son et le texte.",
      "category": "Techniques d'Apprentissage"
    },
    {
      "id": 6,
      "term": "Apprentissage Supervisé",
      "definition": "Méthode d'apprentissage automatique où l'algorithme apprend à partir d'exemples étiquetés (données d'entrée avec les réponses correctes). Le modèle utilise ces exemples pour faire des prédictions sur de nouvelles données non étiquetées.",
      "category": "Techniques d'Apprentissage"
    },
    {
      "id": 7,
      "term": "Apprentissage Non Supervisé",
      "definition": "Technique d'apprentissage automatique où l'algorithme découvre des structures cachées dans des données non étiquetées, sans connaître les réponses correctes. Utilisé pour la classification automatique, la détection d'anomalies et la réduction de dimensionnalité.",
      "category": "Techniques d'Apprentissage"
    },
    {
      "id": 8,
      "term": "Apprentissage par Renforcement",
      "definition": "Méthode d'apprentissage où un agent apprend à prendre des décisions en interagissant avec un environnement. L'agent reçoit des récompenses ou des pénalités selon ses actions, optimisant ainsi sa stratégie au fil du temps.",
      "category": "Techniques d'Apprentissage"
    },
    {
      "id": 9,
      "term": "Transformer",
      "definition": "Architecture de réseau de neurones révolutionnaire utilisant des mécanismes d'attention pour traiter des séquences de données. Les Transformers sont à la base des modèles de langage modernes comme GPT et BERT, excellant dans le traitement du langage naturel.",
      "category": "Architectures et Modèles"
    },
    {
      "id": 10,
      "term": "Modèle de Fondation",
      "definition": "Modèle d'IA large et polyvalent, pré-entraîné sur d'énormes quantités de données, qui peut être adapté à diverses tâches spécifiques. Ces modèles servent de base pour développer des applications IA spécialisées.",
      "category": "Architectures et Modèles"
    },
    {
      "id": 11,
      "term": "LLM (Large Language Model / Grand Modèle de Langage)",
      "definition": "Modèle d'IA entraîné sur de vastes corpus de texte pour comprendre et générer du langage naturel. Les LLM peuvent effectuer diverses tâches linguistiques comme la traduction, la rédaction et la conversation.",
      "category": "Architectures et Modèles"
    },
    {
      "id": 12,
      "term": "IA Générative",
      "definition": "Type d'intelligence artificielle capable de créer du nouveau contenu original (texte, images, audio, vidéo) en apprenant à partir de données existantes. Elle peut produire des créations qui semblent avoir été faites par des humains.",
      "category": "Architectures et Modèles"
    },
    {
      "id": 13,
      "term": "IA Générale (AGI - Artificial General Intelligence)",
      "definition": "Intelligence artificielle hypothétique qui égalerait ou surpasserait l'intelligence humaine dans tous les domaines cognitifs. Contrairement à l'IA spécialisée actuelle, l'AGI pourrait comprendre, apprendre et appliquer ses connaissances de manière flexible.",
      "category": "Architectures et Modèles"
    },
    {
      "id": 14,
      "term": "Données d'EntraÎnement",
      "definition": "Ensemble de données utilisées pour entraîner un modèle d'IA ou de machine learning. Ces données permettent au modèle d'apprendre les modèles et relations nécessaires pour faire des prédictions sur de nouvelles données.",
      "category": "Données et EntraÎnement"
    },
    {
      "id": 15,
      "term": "EntraÎnement de Modèle",
      "definition": "Processus par lequel un algorithme d'IA apprend à partir de données d'entraÎnement pour développer sa capacité à faire des prédictions ou prendre des décisions. L'entraÎnement ajuste les paramètres du modèle pour optimiser ses performances.",
      "category": "Données et EntraÎnement"
    },
    {
      "id": 16,
      "term": "Prompt",
      "definition": "Instruction ou question donnée à un modèle d'IA pour obtenir une réponse spécifique. La qualité et la précision du prompt influencent directement la pertinence et l'utilité de la réponse générée par l'IA.",
      "category": "Applications et Interfaces"
    },
    {
      "id": 17,
      "term": "Éthique de l'IA",
      "definition": "Ensemble de principes moraux et de considérations éthiques concernant le développement et l'utilisation de l'intelligence artificielle. Inclut la transparence, l'équité, la responsabilité et le respect de la vie privée.",
      "category": "Enjeux Éthiques et Réglementaires"
    },
    {
      "id": 18,
      "term": "Biais Algorithmique",
      "definition": "Erreurs systématiques dans les algorithmes d'IA qui produisent des résultats injustes ou discriminatoires envers certains groupes. Ces biais peuvent provenir des données d'entraÎnement ou de la conception de l'algorithme lui-même.",
      "category": "Enjeux Éthiques et Réglementaires"
    },
    {
      "id": 19,
      "term": "API (Application Programming Interface)",
      "definition": "Interface de programmation qui permet à différentes applications de communiquer entre elles. En IA, les APIs permettent d'intégrer facilement des services d'intelligence artificielle dans des applications tierces.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {
      "id": 20,
      "term": "Hallucination (IA)",
      "definition": "Phénomène où un modèle d'IA génère des informations incorrectes, inventées ou non fondées, tout en les présentant avec confiance. C'est un défi majeur des modèles génératifs, particulièrement des LLM.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {
      "id": 21,
      "term": "Fine-tuning (Affinage)",
      "definition": "Processus d'adaptation d'un modèle pré-entraîné à une tâche spécifique en continuant son entraînement sur un ensemble de données plus restreint et ciblé. Permet d'optimiser les performances pour des applications particulières.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {"id":38,
        "term":"tokenisation",
        "definition":"La tokenisation découpe le texte en unités élémentaires (tokens) que le modèle peut traiter numériquement. Chaque token reçoit un identifiant unique dans un vocabulaire fixe. En gros, 1 token=0,75 mot. Cela standardise l'input textuel en nombres pour les réseaux de neurones et permet un découpage quelle que soit la langue.",
        "category":"Concepts de Base"
    },
    {
      "id": 22,
      "term": "Token",
      "definition": "Unité de base utilisée par les modèles de langage pour traiter le texte. Un token peut représenter un mot, une partie de mot, ou même un caractère, selon la méthode de tokenisation utilisée par le modèle.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {
      "id": 23,
      "term": "Inférence",
      "definition": "Processus par lequel un modèle d'IA entraîné utilise ses connaissances acquises pour faire des prédictions ou générer des réponses sur de nouvelles données qu'il n'a jamais vues auparavant.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {
      "id": 24,
      "term": "Hyperparamètres",
      "definition": "Paramètres de configuration qui contrôlent le processus d'entraînement d'un modèle d'IA, comme le taux d'apprentissage, le nombre d'époques, ou la taille des couches. Ils sont définis avant l'entraînement et influencent les performances du modèle.",
      "category": "Glossaire Étendu - Termes Complémentaires"
    },
    {
        "id": 36,
        "term": "RGPD (Règlement Général sur la Protection des Données)",
        "definition": "Règlement européen entré en vigueur en 2018 qui encadre le traitement des données personnelles. En IA, le RGPD impose des obligations strictes sur la collecte, le traitement et l'utilisation des données personnelles pour l'entraînement des modèles.",
        "category": "Enjeux Éthiques et Réglementaires"
    },
    {
        "id": 37,
        "term": "AI Act (Loi européenne sur l'IA)",
        "definition": "Premier cadre réglementaire complet au monde pour l'intelligence artificielle, adopté par l'UE en 2024. Il classe les systèmes d'IA selon leur niveau de risque et impose des obligations proportionnelles, visant à garantir une IA sûre et respectueuse des droits fondamentaux.",
        "category": "Enjeux Éthiques et Réglementaires"
    },
    {
      "id": 25,
      "term": "Alan Turing",
      "definition": "Fondateur théorique de l'informatique moderne et précurseur de l'intelligence artificielle. Créateur de la machine de Turing (1936) et du célèbre test de Turing (1950) pour évaluer l'intelligence des machines. Ses travaux ont posé les bases conceptuelles de l'IA.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 26,
      "term": "John McCarthy",
      "definition": "Créateur du terme 'intelligence artificielle' en 1956. Inventeur du langage de programmation LISP et organisateur de la conférence historique de Dartmouth qui a lancé officiellement le domaine de l'IA. Pionnier de la logique en IA.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 27,
      "term": "Geoffrey Hinton",
      "definition": "Surnommé le 'Parrain du deep learning'. Pionnier de l'algorithme de rétropropagation et des réseaux de neurones profonds. Ses travaux ont révolutionné l'apprentissage automatique moderne. Prix Turing 2018 avec Bengio et LeCun.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 28,
      "term": "Marvin Minsky",
      "definition": "Co-fondateur du MIT AI Lab en 1959. Pionnier des réseaux de neurones, de la représentation des connaissances et de la robotique. Auteur influent sur la théorie de l'esprit et l'intelligence artificielle. Prix Turing 1969.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 29,
      "term": "Yann LeCun",
      "definition": "Architecte des réseaux de neurones convolutifs (CNN) qui ont révolutionné la vision par ordinateur. Directeur scientifique de Meta AI et professeur à NYU. Co-lauréat du prix Turing 2018 pour ses contributions au deep learning.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 30,
      "term": "Yoshua Bengio",
      "definition": "Pionnier du deep learning et des réseaux de neurones récurrents. Professeur à l'Université de Montréal et co-fondateur d'Element AI. Co-lauréat du prix Turing 2018. Militant pour une IA éthique et bénéfique.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 31,
      "term": "Andrew Ng",
      "definition": "Figure majeure de la démocratisation du machine learning. Fondateur de Google Brain, ancien directeur du Stanford AI Lab, co-fondateur de Coursera. Pionnier de l'apprentissage en ligne massif en IA.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 32,
      "term": "Demis Hassabis",
      "definition": "Fondateur et CEO de DeepMind (acquis par Google). Architecte d'AlphaGo qui a battu le champion du monde de Go, et d'AlphaFold qui a révolutionné la prédiction de structure des protéines. Neuroscientifique et entrepreneur.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 33,
      "term": "Judea Pearl",
      "definition": "Révolutionnaire des réseaux bayésiens et de l'inférence causale en IA. Ses travaux sur la causalité ont transformé la compréhension des relations cause-effet dans les systèmes intelligents. Prix Turing 2011.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 34,
      "term": "Stuart Russell",
      "definition": "Référence mondiale en AI safety et alignement de l'IA. Co-auteur du manuel de référence 'Artificial Intelligence: A Modern Approach' (Russell & Norvig). Penseur influent sur les risques et la gouvernance de l'IA.",
      "category": "Personnalités de l'IA"
    },
    {
      "id": 35,
      "term": "Sam Altman",
      "definition": "CEO et co-fondateur d'OpenAI, l'organisation à l'origine de GPT et ChatGPT. Ancien président de Y Combinator. Figure emblématique du développement de l'IA générative et des grands modèles de langage.",
      "category": "Personnalités de l'IA"
    }
   
  ],
  "nextId": 39
}
